# Series.map(arg, na_action=None)[source]

Parameters
arg:function, collections.abc.Mapping subclass or Series
                Mapping correspondence.

na_action: {None, ‘ignore’}, default None
If ‘ignore’, propagate NaN values, without passing them to the mapping correspondence.

Returns: Series-Same index as caller.

In [2]:
import pandas as pd
import numpy as np
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [3]:
s.map({'cat': 'kitten', 'dog': 'puppy'})

0    kitten
1     puppy
2       NaN
3     bunny
dtype: object

In [4]:
s.map({'cat': 'kitten', 'dog': 'puppy', 'rabbit':'bunny'})

0    kitten
1     puppy
2       NaN
3     bunny
dtype: object

In [5]:
s.map('I am a {}'.format)

0       I am a cat
1       I am a dog
2       I am a nan
3    I am a rabbit
dtype: object

In [6]:
s.map('I am a {}'.format, na_action='ignore')

0       I am a cat
1       I am a dog
2              NaN
3    I am a rabbit
dtype: object

In [7]:
def addition(n):
    return n + n
  
# We double all numbers using map()
numbers = (1, 2, 3, 4)
result = map(addition, numbers)
print(list(result))

[2, 4, 6, 8]

In [5]:
numbers = (1, 2, 3, 4)
result = map(lambda n: n + n, numbers)
print(list(result))

[2, 4, 6, 8]

# Lambda Function

#Syntax: lambda arguments: expression
#A lambda function is a small anonymous function.

#A lambda function can take any number of arguments, but can only have one expression.

In [7]:
x = lambda a, b, c : a + b + c
print(x(1, 2, 3))

6

In [8]:
n1 = [1, 2, 3]
n2 = [4, 5, 6]
  
result = map(lambda x, y: x + y, n1, n2)
print(list(result))

[5, 7, 9]

In [11]:
import pandas as pd
  
# creating and initializing a list
values= [['Rohan',455],['Elvish',250],['Deepak',495],
         ['Soni',400],['Radhika',350],['Vansh',450]]
 
# creating a pandas dataframe
df = pd.DataFrame(values,columns=['Name','Total_Marks'])
 
# Applying lambda function to find
# percentage of 'Total_Marks' column
# using df.assign()
df = df.assign(percentage = lambda x: (x['Total_Marks'] /500 * 100))
 
# displaying the data frame
df

      Name  Total_Marks  percentage
0    Rohan          455        91.0
1   Elvish          250        50.0
2   Deepak          495        99.0
3     Soni          400        80.0
4  Radhika          350        70.0
5    Vansh          450        90.0

In [15]:
import pandas as pd
import numpy as np
 
# creating and initializing a nested list
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80],
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90],
               [51, 2.3, 111]]
 
# creating a pandas dataframe
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3'],
                  index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])
print(df)
 
# Apply function numpy.square() to square
# the values of 3 rows only i.e. with row
# index name 'a', 'e' and 'g' only
df = df.apply(lambda x: np.square(x) if x.name in [
              'a', 'e', 'g'] else x, axis=1)
 
# printing dataframe
df

   Field_1  Field_2  Field_3
a       15      2.5      100
b       20      4.5       50
c       25      5.2       80
d       45      5.8       48
e       40      6.3       70
f       41      6.4       90
g       51      2.3      111

   Field_1  Field_2  Field_3
a    225.0     6.25  10000.0
b     20.0     4.50     50.0
c     25.0     5.20     80.0
d     45.0     5.80     48.0
e   1600.0    39.69   4900.0
f     41.0     6.40     90.0
g   2601.0     5.29  12321.0

# filter() in python

The filter() method filters the given sequence with the help of a function that tests each element in the sequence to be true or not

In [19]:
#Syntax: DataFrame.filter(items=None, like=None, regex=None, axis=None)

#Parameters:
#items : List of info axis to restrict to (must not all be present)
#like : Keep info axis where “arg in col == True”
#regex : Keep info axis with re.search(regex, col) == True
#axis : The axis to filter on. By default this is the info axis, ‘index’ for Series, ‘columns’ for DataFrame

In [20]:
# a list contains both even and odd numbers. 
seq = [0, 1, 2, 3, 5, 8, 13]
  
# result contains odd numbers of the list
result = filter(lambda x: x % 2 != 0, seq)
print(list(result))
  
# result contains even numbers of the list
result = filter(lambda x: x % 2 == 0, seq)
print(list(result))

[1, 3, 5, 13]
[0, 2, 8]

In [19]:
# importing pandas as pd
import pandas as pd
  
# Creating the dataframe 
df = pd.read_csv("dataset/nba.csv")
  
# Print the dataframe
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [20]:
# applying filter function 
df.filter(["Name", "College", "Salary"])

              Name            College     Salary
0    Avery Bradley              Texas  7730337.0
1      Jae Crowder          Marquette  6796117.0
2     John Holland  Boston University        NaN
3      R.J. Hunter      Georgia State  1148640.0
4    Jonas Jerebko                NaN  5000000.0
..             ...                ...        ...
453   Shelvin Mack             Butler  2433333.0
454      Raul Neto                NaN   900000.0
455   Tibor Pleiss                NaN  2900000.0
456    Jeff Withey             Kansas   947276.0
457            NaN                NaN        NaN

[458 rows x 3 columns]

In [26]:
# importing pandas as pd
import pandas as pd
  
# Creating the dataframe 
df = pd.read_csv("dataset/nba.csv")
  

df.filter(regex ='[tT]')

               Team Position Height  Weight
0    Boston Celtics       PG    6-2   180.0
1    Boston Celtics       SF    6-6   235.0
2    Boston Celtics       SG    6-5   205.0
3    Boston Celtics       SG    6-5   185.0
4    Boston Celtics       PF   6-10   231.0
..              ...      ...    ...     ...
453       Utah Jazz       PG    6-3   203.0
454       Utah Jazz       PG    6-1   179.0
455       Utah Jazz        C    7-3   256.0
456       Utah Jazz        C    7-0   231.0
457             NaN      NaN    NaN     NaN

[458 rows x 4 columns]

# Reduce FUNCTION

The reduce(fun,seq) function is used to apply a particular function passed in its argument to all of the list elements mentioned in the sequence passed along.This function is defined in “functools” module.

In [24]:
# python code to demonstrate working of reduce()
# using operator functions
 
# importing functools for reduce()
import functools as ft
 
# importing operator for operator functions
import operator as op
 
# initializing list
lis = [1, 3, 5, 6, 2]
 
# using reduce to compute sum of list
# using operator functions
print("The sum of the list elements is : ", end="")
print(ft.reduce(op.add, lis))
 
# using reduce to compute product
# using operator functions
print("The product of list elements is : ", end="")
print(ft.reduce(op.mul, lis))

The sum of the list elements is : 17
The product of list elements is : 180